{
  "siteTitle": "Explain Ethereum",
  "languageSwitch": "Language",
  
  "nav": {
    "home": "Home",
    "intro": "Introduction",
    "tokens": "Tokens",
    "apps": "Apps",
    "playground": "Playground"
  },
  
  "intro": {
    "title": "Intro",
    "opening": [
      "Hi, if you have no idea what Ethereum, blockchains, and smart contracts are, this is for you!",
      "This is a series of articles that tries to explain the basics of blockchain in a simplified way. I do my best to avoid heavy math or programming jargon, but there will be some new words and ideas. I try to use real-world examples when possible to help bridge the gap.",
      "(For all the experts in the room, just enjoy the animations.)",
      "Along the way, we'll cover how blockchains:"
    ],
    "capabilities": [
      "Let us send and receive money 24/7",
      "Automatically split bills",
      "Earn interest on our dollars",
      "Unlock new types of apps"
    ],
    "ethereum": [
      "Ethereum",
      "Let's get started.",
      "What is Ethereum?",
      "Ethereum is a blockchain network for sending money and running apps.",
      "What does that mean?"
    ],
    "network": [
      "In general, a network is a group of connected things, like a social network. As long as something is in the network, you can reach it. Just like how on the Facebook network, you can send a message to anyone as long as they have an account.",
      "(I know we didn't define blockchain yet, don't worry, we'll get to it.)"
    ],
    "account": [
      "Like a social media network, you'll need an account to get started using Ethereum. An account will let you receive money. You can receive many types of digital assets with your account.",
      "Let's give you a test account to get started:",
      "Every account has a unique ID, called an address. Your simulated address is 0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2. Just like how an email address lets you receive emails on the internet, your Ethereum address lets you receive ETH on the Ethereum network."
    ],
    "eth": [
      "What is ETH? ETH is the native currency of the Ethereum network. Like Bitcoin, it's another digital currency that you can trade or transfer.",
      "Here, let's give you 1 (simulated) ETH to get started below."
    ],
    "sending": [
      "Now that you have some ETH, you can send it around to other people.",
      "Let's give you some simulated friends to send money to.",
      "Meet Alice, Bob, and Carol.",
      "Now try sending them some ETH!"
    ],
    "confirmation": [
      "So far you have sent {amount} ETH. Nice! After sending ETH, we get the pop-up below. What does it mean?",
      "Once it turns green, your send transaction has been confirmed. This lets you know that it was successful, i.e. that it went through."
    ],
    "timing": [
      "Sending money on Ethereum isn't instant. It's faster than a bank transfer (no need to wait 1-2 business days), but it's also a little slower than Venmo or Zelle.",
      "Specifically, on Ethereum, it takes up to 12 seconds to complete a transaction."
    ],
    "train": [
      "Imagine that we're at a train station, and we want to deliver some packages to the next stop. If we have multiple packages to deliver, we can still put them all on the same train, and they'll all get delivered together at the next stop."
    ],
    "blocks": [
      "It's because of something called block time. On Ethereum, it takes about 12 seconds for the network to create a block. This \"block\" is what makes up the word \"blockchain.\"",
      "When we send out all these different transactions, they get collected into a block. So a block is a list of all the transactions that have happened. And a new block gets published around every 12 seconds.",
      "Once we have more than one block, we have a blockchain. As the name suggests, it's a chain of blocks, or an ordered list of transactions."
    ],
    "apps": [
      "In addition to sending ETH around, we can also interact with apps on the Ethereum network. These interactions are also transactions!",
      "Let's explore the basics of apps..."
    ],
    "ui": {
      "transactionHistory": "Transaction History",
      "viewHistory": "View transaction history"
    }
  },
  
  "tokens": {
    "title": "Tokens",
    "introduction": [
      "What is a token?",
      "A token is a currency that can be sent on a blockchain network.",
      "You can receive all types of tokens with the same address. There's no need to use a new account for each token type."
    ],
    "stablecoins": [
      "Stablecoins",
      "Stablecoins are tokens that are designed to maintain a stable value, usually pegged to a currency like the US dollar.",
      "Traditional cryptocurrencies like ETH can be very volatile, while stablecoins maintain stable prices."
    ]
  },
  
  "apps": {
    "title": "Apps",
    "introduction": [
      "An app on Ethereum is a program that can also send or receive ETH according to its own rules.",
      "In blockchain jargon, this type of program is called a smart contract.",
      "Here are some examples of what smart contracts can do:"
    ],
    "examples": [
      "Bill Splitting: Automatically split bills between multiple people",
      "Escrow: Hold funds until certain conditions are met", 
      "Subscriptions: Automatically charge users on a recurring basis"
    ]
  },
  
  "apps2": {
    "title": "Apps (But Now With Tokens)",
    "introduction": [
      "With stablecoins, we can now send dollars and transact in more familiar ways.",
      "We've already covered how smart contracts can let us write different types of apps to handle payments, split bills, share fees, etc.",
      "What happens when we combine them?",
      "Here, we'll cover more varied app types like:"
    ],
    "appTypes": [
      "Earning Yield: how to earn interest on your dollars, similar to a high-yield savings account",
      "Lending: how to lend your money to others and earn interest", 
      "Trading: how to exchange different types of tokens",
      "Insurance: how to protect your investments"
    ],
    "status": [
      "This section is under construction"
    ]
  },
  
  "playground": {
    "title": "Playground",
    "ui": {
      "ethereumMainnet": "Ethereum Mainnet",
      "rollupChain": "Rollup Chain"
    }
  },
  
  "common": {
    "loading": "Loading...",
    "error": "Error",
    "retry": "Retry",
    "back": "Back",
    "next": "Next",
    "previous": "Previous",
    "close": "Close",
    "viewHistory": "View transaction history",
    "transactionHistory": "Transaction History"
  }
}